app/Controllers/Formulir.php

SELECT *
FROM `formulir`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `formulir`
---
    public function index()
    {

        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $surat = $this->model->search($keyword);
        } else {
            $surat = $this->model;
        }

        $data = [
            'judul' => 'Data Softcopy Formulir',
            'formulir' => $this->model->paginate('10'),