app/Controllers/MemoKeluar.php

    public function index()
    {

        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $surat = $this->model->search($keyword);
        } else {
            $surat = $this->model;
        }

        $data = [
            'judul' => 'Data Memo Keluar',
            'memokeluar' => $this->model->paginate('10'),
---
SELECT *
FROM `memokeluar`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `memokeluar`