app/Controllers/MemoMasuk.php

SELECT *
FROM `memomasuk`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `memomasuk`
---
    public function index()
    {

        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $surat = $this->model->search($keyword);
        } else {
            $surat = $this->model;
        }

        $data = [
            'judul' => 'Data Memo Masuk',
            'memomasuk' => $this->model->paginate('10'),