app/Controllers/Penawaran.php

    public function index()
    {
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $surat = $this->model->search($keyword);
        } else {
            $surat = $this->model;
        }

        $data = [
            'judul' => 'Data Memo Masuk',
            'penawaran' => $this->model->paginate('10'),
---
SELECT *
FROM `penawaran`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `penawaran`