app/Controllers/Perizinan.php

    public function index()
    {

        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $surat = $this->model->search($keyword);
        } else {
            $surat = $this->model;
        }

        $data = [
            'judul' => 'Data Surat Keputusan',
            'perizinan' => $this->model->paginate('5'),
---
SELECT *
FROM `perizinan`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `perizinan`