app/Controllers/SuratMasuk.php

    public function index()
    {

        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $surat = $this->model->search($keyword);
        } else {
            $surat = $this->model;
        }

        $data = [
            'judul' => 'Data Surat Masuk',
            'suratmasuk' => $this->model->paginate('5'),
---
SELECT *
FROM `suratmasuk`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `suratmasuk`