app/Controllers/SuratKeluar.php

SELECT *
FROM `surat_keluar`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `surat_keluar`
---
    public function index()
    {

        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $surat = $this->model->search($keyword);
        } else {
            $surat = $this->model;
        }

        $data = [
            'judul' => 'Data Surat Keluar',
            'suratkeluar' => $this->model->paginate('10'),
            'pager' => $this->model->pager
        ];