app/Controllers/Tender.php

    public function index()
    {

        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $surat = $this->model->search($keyword);
        } else {
            $surat = $this->model;
        }

        $data = [
            'judul' => 'Data Memo Masuk',
            'tender' => $this->model->paginate('10'),
---
SELECT *
FROM `tender`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `tender`