app/Models/DisposisiModel.php

    public function getAllData($id = false)
    {
        if ($id == false) {
            return $this->findAll();
---
SELECT *
FROM `disposisi`

    public function getAllSuratMasuk()
    {
        $builder = $this->db->table('suratmasuk as s');
        $builder->select('s.*, GROUP_CONCAT(b.nama_bidang SEPARATOR ",") as bidang');
        $builder->join('terdisposisi as t', 't.id_surat=s.id');
        $builder->join('nama_bidang_tb as b', 'b.id_bidang=t.id_bidang');
        $builder->groupBy('s.id');
        $query = $builder->get();
---
SELECT `s`.*, GROUP_CONCAT(b.nama_bidang SEPARATOR ", ") as bidang
FROM `suratmasuk` as `s`
JOIN `terdisposisi` as `t` ON `t`.`id_surat`=`s`.`id`
JOIN `nama_bidang_tb` as `b` ON `b`.`id_bidang`=`t`.`id_bidang`
GROUP BY `s`.`id`

    public function getSuratMasukById($id)
    {
        $builder = $this->db->table('suratmasuk as s');
        $builder->select('s.*, GROUP_CONCAT(b.nama_bidang SEPARATOR ",") as bidang');
        $builder->join('terdisposisi as t', 't.id_surat=s.id');
        $builder->join('nama_bidang_tb as b', 'b.id_bidang=t.id_bidang');
        $builder->where('s.id', $id);
        $builder->groupBy('s.id');
        $query = $builder->get();
---
SELECT `s`.*, GROUP_CONCAT(b.nama_bidang SEPARATOR ", ") as bidang
FROM `suratmasuk` as `s`
JOIN `terdisposisi` as `t` ON `t`.`id_surat`=`s`.`id`
JOIN `nama_bidang_tb` as `b` ON `b`.`id_bidang`=`t`.`id_bidang`
WHERE `s`.`id` = '59'
GROUP BY `s`.`id`

    public function getTerdisposisiBySurat($id)
    {
        $builder = $this->db->table('terdisposisi');
        $builder->where(['id_surat' => $id]);
        $query = $builder->get();
---
SELECT *
FROM `terdisposisi`
WHERE `id_surat` = '59'