app/Models/EmailKeluar_Model.php

UPDATE `emailkeluar` SET `tgl_emailkeluar` = '2022-03-23', `no_emailkeluar` = '112', `kepada` = 'HKP', `perihal` = 'Permohonan', `kode_proyek` = '05', `nama_proyek` = 'Awokawokawok', `tembusan` = 'PLN', `ordner` = 'CV_Arka Arifiandi Leonanta_2.pdf'
WHERE `id` = ''
---
    public function ubahemailkeluar($data, $id)
    {
        return $this->db->table('emailkeluar')->update($data, ['id' => $id]);