app/Models/Formulir_Model.php

INSERT INTO `formulir` (`ordner`, `keterangan`) VALUES ('Surat Lamaran.docx', 'Softcopy')
---
    public function addformulir($data)
    {
        return $this->table('formulir_formulir')->insert($data);