app/Models/HomeAdmin_Modal.php

    public function tot_suratm()
    {
        return $this->db->table('suratmasuk')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `surat_masuk`

    public function tot_suratk()
    {
        return $this->db->table('suratkeluar')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `surat_keluar`

    public function tot_user()
    {
        return $this->db->table('user_tb')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `user_tb`

    public function tot_emailmasuk()
    {
        return $this->db->table('emailmasuk')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `emailmasuk`

    public function tot_emailkeluar()
    {
        return $this->db->table('emailkeluar')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `emailkeluar`

    public function tot_formulir()
    {
        return $this->db->table('formulir')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `formulir`

    public function tot_memomasuk()
    {
        return $this->db->table('memomasuk')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `memomasuk`

    public function tot_memokeluar()
    {
        return $this->db->table('memokeluar')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `memokeluar`

    public function tot_suratkeputusan()
    {
        return $this->db->table('surat_keputusan')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `surat_keputusan`

    public function tot_perizinan()
    {
        return $this->db->table('perizinan')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `perizinan`

    public function tot_berkas()
    {
        return $this->db->table('penawaran')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `penawaran`

    public function tot_tender()
    {
        return $this->db->table('tender')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tender`