app/Models/Tender_Model.php

    public function hapustender($id)
    {
        return $this->db->table('tender')->delete(['id_tender' => $id]);
---
DELETE FROM `tender`
WHERE `id_tender` = '1'