app/Models/Users_Model.php

    public function cekLogin($username, $password)
    {
        $queryLogin = $this->db->table('user_tb')
            ->where(array('username' => $username, 'password' => $password))
            ->get()->getRowArray();
---
SELECT *
FROM `user_tb`
WHERE `username` = 'pemasaran'
AND `password` = '229eaac0894a3379d759a720e0e3410c'